In [ ]:
import pandas as pd
file_name="/content/amazon_fires (3).csv"
df=pd.read_csv(file_name,encoding="ISO-8859-1")
df.head(10)

    ano      mes estado    numero    encontro
0  1998  Janeiro   Acre   0 Fires  01-01-1998
1  1999  Janeiro   Acre   0 Fires  01-01-1999
2  2000  Janeiro   Acre   0 Fires  01-01-2000
3  2001  Janeiro   Acre   0 Fires  01-01-2001
4  2002  Janeiro   Acre   0 Fires  01-01-2002
5  2003  Janeiro   Acre  10 Fires  01-01-2003
6  2004  Janeiro   Acre   0 Fires  01-01-2004
7  2005  Janeiro   Acre  12 Fires  01-01-2005
8  2006  Janeiro   Acre   4 Fires  01-01-2006
9  2007  Janeiro   Acre   0 Fires  01-01-2007

In [ ]:
df.tail(10)

      ano        mes estado numero    encontro
505  2004  Fevereiro  Amapa      2  01-01-2004
506  2005  Fevereiro  Amapa      1  01-01-2005
507  2006  Fevereiro  Amapa      2  01-01-2006
508  2007  Fevereiro  Amapa      0  01-01-2007
509  2008  Fevereiro  Amapa      0  01-01-2008
510  2009  Fevereiro  Amapa      0  01-01-2009
511  2010  Fevereiro  Amapa      0  01-01-2010
512  2011  Fevereiro  Amapa      3  01-01-2011
513  2012  Fevereiro  Amapa      5  01-01-2012
514  2013  Fevereiro  Amapa      0  01-01-2013

In [ ]:
df['estado'].unique()

array(['Acre', 'alagoas', 'Amapa'], dtype=object)

Rename Columns

In [ ]:
new_order=[4,1,0,2,3]
df=df[df.columns[new_order]]
df.head()

     encontro      mes   ano estado   numero
0  01-01-1998  Janeiro  1998   Acre  0 Fires
1  01-01-1999  Janeiro  1999   Acre  0 Fires
2  01-01-2000  Janeiro  2000   Acre  0 Fires
3  01-01-2001  Janeiro  2001   Acre  0 Fires
4  01-01-2002  Janeiro  2002   Acre  0 Fires

In [ ]:
df.tail()

       encontro        mes   ano estado numero
510  01-01-2009  Fevereiro  2009  Amapa      0
511  01-01-2010  Fevereiro  2010  Amapa      0
512  01-01-2011  Fevereiro  2011  Amapa      3
513  01-01-2012  Fevereiro  2012  Amapa      5
514  01-01-2013  Fevereiro  2013  Amapa      0

Determine if  the columns contain the numerical data

In [ ]:
df['number_of_fires'].str.isnumeric()

0      False
1      False
2      False
3      False
4      False
       ...
510     True
511     True
512     True
513     True
514     True
Name: number_of_fires, Length: 515, dtype: object

In [ ]:
file_name="/content/amazon_fires (3).csv"
df=pd.read_csv(file_name,encoding="ISO-8859-1")
new_columns={'ano':'year',
             'estado':'state',
             'mes':'month',
             'numero':'number_of_fires',
             'encontro':'date'}
df.rename(columns=new_columns,inplace=True)
df['number_of_fires']=df['number_of_fires'].str.strip("Fires")
df_copy=df.copy()
df.head()

   year    month state number_of_fires        date
0  1998  Janeiro  Acre              0   01-01-1998
1  1999  Janeiro  Acre              0   01-01-1999
2  2000  Janeiro  Acre              0   01-01-2000
3  2001  Janeiro  Acre              0   01-01-2001
4  2002  Janeiro  Acre              0   01-01-2002

In [ ]:
df.isnull().sum()

year               0
mes                0
state              0
number_of_fires    5
date               0
dtype: int64

In [ ]:
df=df.dropna()
df=df.reset_index()
df.head()

   index  year      mes state number_of_fires        date
0      0  1998  Janeiro  Acre              0   01-01-1998
1      1  1999  Janeiro  Acre              0   01-01-1999
2      2  2000  Janeiro  Acre              0   01-01-2000
3      3  2001  Janeiro  Acre              0   01-01-2001
4      4  2002  Janeiro  Acre              0   01-01-2002

In [ ]:
df.isnull().sum()

index              0
year               0
mes                0
state              0
number_of_fires    0
date               0
dtype: int64

In [ ]:
df.tail()

     index  year        mes  state number_of_fires        date
505    510  2009  Fevereiro  Amapa               0  01-01-2009
506    511  2010  Fevereiro  Amapa               0  01-01-2010
507    512  2011  Fevereiro  Amapa               3  01-01-2011
508    513  2012  Fevereiro  Amapa               5  01-01-2012
509    514  2013  Fevereiro  Amapa               0  01-01-2013

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 510 entries, 0 to 509
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            510 non-null    int64
 1   year             510 non-null    int64
 2   mes              510 non-null    object
 3   state            510 non-null    object
 4   number_of_fires  510 non-null    object
 5   date             510 non-null    object
dtypes: int64(2), object(4)
memory usage: 24.0+ KB

In [ ]:
df=df.drop(['month','date'],axis=1)
df.head()

   year state number_of_fires
0  1998  Acre              0
1  1999  Acre              0
2  2000  Acre              0
3  2001  Acre              0
4  2002  Acre              0

In [ ]:
df=df.drop(df.index[1:4])
df.head()

    level_0  index  year state number_of_fires
0         1      2  2000  Acre              0
8         9     10  2008  Acre              0
9        10     11  2009  Acre              0
10       11     12  2010  Acre              1
11       12     13  2011  Acre              0